ab-tests/rfc2616.pdf/ab_multiprocessing_secure_c200.txt
C:\xampp\apache\bin>abs -n 1000 -c 200 -s 86400 https://192.168.2.19:20001/rfc2616.pdf
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.2.19 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
SSL handshake failed (5).
SSL handshake failed (5).
SSL handshake failed (5).
[...]
Completed 600 requests
SSL handshake failed (5).
SSL handshake failed (5).
SSL handshake failed (5).
[...]
Completed 700 requests
SSL handshake failed (5).
SSL handshake failed (5).
SSL handshake failed (5).
[...]
Completed 800 requests
SSL handshake failed (5).
SSL handshake failed (5).
SSL handshake failed (5).
[...]
Completed 900 requests
SSL handshake failed (5).
SSL handshake failed (5).
SSL handshake failed (5).
[...]
Completed 1000 requests
SSL handshake failed (5).
SSL handshake failed (5).
Finished 1000 requests


Server Software:        myserver/1.0
Server Hostname:        192.168.2.19
Server Port:            20001
SSL/TLS Protocol:       TLSv1.2,ECDHE-RSA-AES256-GCM-SHA384,2048,256
Server Temp Key:        X25519 253 bits

Document Path:          /rfc2616.pdf
Document Length:        550562 bytes

Concurrency Level:      200
Time taken for tests:   252.239 seconds
Complete requests:      1000
Failed requests:        301
   (Connect: 0, Receive: 0, Length: 301, Exceptions: 0)
Total transferred:      386054500 bytes
HTML transferred:       385952008 bytes
Requests per second:    3.96 [#/sec] (mean)
Time per request:       50447.835 [ms] (mean)
Time per request:       252.239 [ms] (mean, across all concurrent requests)
Transfer rate:          1494.64 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0 5736 13132.4   1012   93356
Processing:    26 37779 57547.2    592  182826
Waiting:        0  254 770.6     71   21367
Total:         51 43515 55308.3   7716  182826

Percentage of the requests served within a certain time (ms)
  50%   7716
  66%  35425
  75%  112735
  80%  114077
  90%  132782
  95%  133314
  98%  134264
  99%  170149
 100%  182826 (longest request)